app/views/users/list.html.erb

SELECT `users`.* FROM `users`
---
<div class="user-list">
  <%= render partial: 'list', locals: { users: User.all } %>